In [1]:
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/Danxi3/Guzman_Daniella_BSIS2/refs/heads/main/students_dataset.csv"
df = pd.read_csv(url)

In [3]:
print(df.head())
print(df.info())

  FirstName LastName   Age     Course  Grade
0      Emma    Smith  18.0        NaN  75.07
1      John      NaN  25.0      Music  81.47
2     Maria   Garcia  24.0        Art  66.35
3     Chris   Taylor  24.0  Chemistry  72.77
4       NaN   Garcia  25.0       Math  88.05
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   FirstName  43 non-null     object
 1   LastName   45 non-null     object
 2   Age        48 non-null     float64
 3   Course     44 non-null     object
 4   Grade      47 non-null     float64
dtypes: float64(2), object(3)
memory usage: 2.1+ KB
None

In [4]:
df["FirstName"] = df["FirstName"].fillna("NA")

In [5]:
df["LastName"] = df["LastName"].fillna("NA")

In [8]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [9]:
df["Course"] = df["Course"].fillna("Undefined Course")

In [10]:
df["Grade"] = df["Grade"].fillna(df["Grade"].mean())

In [12]:
pd.set_option("display.max_rows", None)  # Remove row limit
print(df)

   FirstName LastName        Age            Course      Grade
0       Emma    Smith  18.000000  Undefined Course  75.070000
1       John       NA  25.000000             Music  81.470000
2      Maria   Garcia  24.000000               Art  66.350000
3      Chris   Taylor  24.000000         Chemistry  72.770000
4         NA   Garcia  25.000000              Math  88.050000
5      Chris   Garcia  20.000000  Undefined Course  69.260000
6    Michael    Smith  21.000000  Undefined Course  96.310000
7      Chris    White  18.000000         Chemistry  64.550000
8      Sarah    White  20.000000                PE  93.740000
9      Maria    Lewis  24.000000         Chemistry  76.840000
10      John    Smith  22.000000           English  77.891702
11        NA   Martin  23.000000           History  84.030000
12     Maria    Lewis  21.000000           Physics  60.290000
13      Emma    Smith  20.000000                PE  86.840000
14      John       NA  18.000000                PE  70.540000
15     David  Johnson  23.000000               Art  61.090000
16      John   Garcia  20.000000                PE  81.660000
17      Alex    Clark  21.166667  Undefined Course  80.730000
18     Maria   Garcia  25.000000           Physics  91.910000
19        NA    Lewis  20.000000           English  83.300000
20      Emma      Lee  19.000000  Undefined Course  69.340000
21      Emma    Brown  18.000000           Biology  85.980000
22     Sarah    Smith  19.000000         Chemistry  96.670000
23   Michael    Smith  19.000000               Art  63.360000
24      Emma       NA  22.000000  Undefined Course  62.800000
25      Alex    Smith  20.000000           Physics  69.230000
26        NA   Martin  21.166667              Math  67.020000
27     Maria   Taylor  20.000000              Math  87.140000
28     David    White  19.000000           Biology  96.420000
29      John    Brown  24.000000                PE  60.790000
30     Chris    Brown  24.000000           Physics  78.080000
31     Chris    Clark  20.000000           History  80.410000
32      John    Brown  21.000000         Chemistry  66.690000
33    Daniel    Brown  25.000000           Science  63.490000
34        NA  Johnson  23.000000         Chemistry  77.891702
35   Michael    White  19.000000           Science  71.220000
36     Chris       NA  18.000000           History  88.950000
37        NA    Clark  19.000000           Physics  80.630000
38     David  Johnson  20.000000         Chemistry  78.960000
39     Sarah   Martin  25.000000           Science  85.550000
40        NA      Lee  19.000000              Math  96.180000
41     Chris   Martin  24.000000                PE  68.210000
42      Jane       NA  20.000000                PE  93.990000
43     Chris    Lewis  25.000000              Math  94.890000
44      Emma  Johnson  20.000000         Chemistry  68.970000
45      John    Lewis  19.000000         Chemistry  77.891702
46      Emma    Clark  20.000000             Music  60.190000
47   Michael   Martin  21.000000             Music  85.310000
48     Maria   Garcia  18.000000             Music  61.900000
49     Maria      Lee  25.000000           Science  93.740000

In [22]:
df = df.drop_duplicates(subset=["FirstName", "LastName", "Age"])

In [23]:
pd.set_option("display.max_rows", None)
print(df)

   FirstName LastName        Age            Course      Grade
0       Emma    Smith  18.000000  Undefined Course  75.070000
1       John       NA  25.000000             Music  81.470000
2      Maria   Garcia  24.000000               Art  66.350000
3      Chris   Taylor  24.000000         Chemistry  72.770000
4         NA   Garcia  25.000000              Math  88.050000
5      Chris   Garcia  20.000000  Undefined Course  69.260000
6    Michael    Smith  21.000000  Undefined Course  96.310000
7      Chris    White  18.000000         Chemistry  64.550000
8      Sarah    White  20.000000                PE  93.740000
9      Maria    Lewis  24.000000         Chemistry  76.840000
10      John    Smith  22.000000           English  77.891702
11        NA   Martin  23.000000           History  84.030000
12     Maria    Lewis  21.000000           Physics  60.290000
13      Emma    Smith  20.000000                PE  86.840000
14      John       NA  18.000000                PE  70.540000
15     David  Johnson  23.000000               Art  61.090000
16      John   Garcia  20.000000                PE  81.660000
17      Alex    Clark  21.166667  Undefined Course  80.730000
18     Maria   Garcia  25.000000           Physics  91.910000
19        NA    Lewis  20.000000           English  83.300000
20      Emma      Lee  19.000000  Undefined Course  69.340000
21      Emma    Brown  18.000000           Biology  85.980000
22     Sarah    Smith  19.000000         Chemistry  96.670000
23   Michael    Smith  19.000000               Art  63.360000
24      Emma       NA  22.000000  Undefined Course  62.800000
25      Alex    Smith  20.000000           Physics  69.230000
26        NA   Martin  21.166667              Math  67.020000
27     Maria   Taylor  20.000000              Math  87.140000
28     David    White  19.000000           Biology  96.420000
29      John    Brown  24.000000                PE  60.790000
30     Chris    Brown  24.000000           Physics  78.080000
31     Chris    Clark  20.000000           History  80.410000
32      John    Brown  21.000000         Chemistry  66.690000
33    Daniel    Brown  25.000000           Science  63.490000
34        NA  Johnson  23.000000         Chemistry  77.891702
35   Michael    White  19.000000           Science  71.220000
36     Chris       NA  18.000000           History  88.950000
37        NA    Clark  19.000000           Physics  80.630000
38     David  Johnson  20.000000         Chemistry  78.960000
39     Sarah   Martin  25.000000           Science  85.550000
40        NA      Lee  19.000000              Math  96.180000
41     Chris   Martin  24.000000                PE  68.210000
42      Jane       NA  20.000000                PE  93.990000
43     Chris    Lewis  25.000000              Math  94.890000
44      Emma  Johnson  20.000000         Chemistry  68.970000
45      John    Lewis  19.000000         Chemistry  77.891702
46      Emma    Clark  20.000000             Music  60.190000
47   Michael   Martin  21.000000             Music  85.310000
48     Maria   Garcia  18.000000             Music  61.900000
49     Maria      Lee  25.000000           Science  93.740000

In [24]:
df.to_csv("students_dataset_cleaned.csv", index=False)